"""1 Вычислить число π c заданной точностью d
*Пример:*
- при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$
https://completerepair.ru/kak-vychislit-chislo-pi """

# Формула 1 - 1/3 + (1/(2n+1)*(-1)^n
def pi():
    k = 1
    x = 0
    for k in range(1, 1000000):
        x = x + 4 * ((-1) ** (k + 1)) / (2 * k - 1)
    return x

n = int(input("Введите число для вычесления числа пи до заданной точности: "))
print(round(pi(), n))